/*

Basic Javascript Checklist: 
বেসিক জাভাস্ক্রিপ্ট চেকলিস্ট 

১. আমি যদি বলি তিনটা ভেরিয়েবল ডিক্লেয়ার করতে হবে। সেটা তোমাকে পারতে হবে। 

২. একটা লুপ লিখতে হবে যেটা ১ থেকে ১০০ পর্যন্ত যত সংখ্যা আছে সেটা দেখাবে 

৩. ৫০ থেকে ৮০ এর মধ্যে যতো বিজোড় সংখ্যা আছে সেগুলাকে দেখাবে। 

৪. তিনটা সংখ্যা এর যোগ করতে পারবে এমন একটা ফাংশন লিখো 


------------------------
 SIX CORE CONCEPTS
 1. Variable (declare, naming,types, primitive, math operation, converson)
 2. Conditional (Comparetion >,<, <=,i==, ===, if-else)
 3. Array (Declare, index, get values, set values, indexof, push, pop)
 4. Loop (for loop, while loop, break, continue)
 5. function (declare, parameter, return, call, return value from function)
 6. object (properties,keys, values, set value, loop object)

*/

/*
1. Farenhight to Celcious
2. Celcious to Farenheight
3. simple interest
4. complex conterest

ছাড়াও আজকের ভিডিওতে চারটা প্রব্লেম এর কথা বলেছি।
সেগুলা মাস্ট প্রাকটিস করো। নিজে নিজে চিন্তা করো 

১. তোমাকে ফাংশনের ইনপুট হিসেবে সেলসিয়াস দিবে।
তুমি ক্যালকুলেশন করে তাপমাত্রা ফারেনহাইট এ কনভার্ট করে সেটার আউটপুট রিটার্ন করবে 

২. একইভাবে উল্টা হিসাব করবে।
যাতে তোমাকে ফারেনহাইট হিসেবে তাপমাত্রা দিলে সেটাকে সেলসিয়াস এ কনভার্ট করে আউটপুট দিবে। 

৩. কেউ ১০০ এর মধ্যে কত মার্ক্স্ পেয়েছে সেটা তোমাকে বলে দিবে।
তুমি একটা ফাংশন দিয়ে বলে দিবে সে এ+ পাবে নাকি অন্য কোন গ্রেড পাবে। 

৪. সুদের হিসাব করবে। জাস্ট হিসাব কেমনে করতে হয়।
 সেই চিন্তায় করবে। সুদ ভালো না খারাপ সেটা এখন চিন্তা করার দরকার নাই।
জাস্ট একটা ফর্মুলা থাকলে সেটা কিভাবে কোড এ লিখতে হয় সেই এঙ্গেল থেকে করার চেষ্টা করো। 

*/
